Examinator/src/Catalogs/КаталогМероприятийСУО/КаталогМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаталогМероприятийСУО</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.СхемыМероприятийСУО</owners>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>EnumRef.МестаПроведенияМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипАудитории</name>
    <type>
      <types>CatalogRef.ТипыАудиторийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольПреподавателя</name>
    <type>
      <types>CatalogRef.РолиПреподавателейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Значимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРазработки</name>
    <type>
      <types>EnumRef.СтатусыРазработкиОбъектовСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>Продолжительность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВсеТемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВИнтернете</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательноеПрохождениеЗаданий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьПовторноеПрохождение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Темы</name>
    <attributes>
      <name>Тема</name>
      <type>
        <types>CatalogRef.СодержаниеМероприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлектронныеРесурсы</name>
    <attributes>
      <name>ЭлектронныйРесурс</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПослеПрохождения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗапланировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеАктивно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗавершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавитьВБиблиотеку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПослеПрохождения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавитьВБиблиотеку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗапланировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеАктивно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗавершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.ЛитератураСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеКнигиСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПослеПрохождения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДобавитьВБиблиотеку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПриПроведении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗапланировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеАктивно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказатьПриСтатусеЗавершено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПреподаватели</name>
    <attributes>
      <name>РольПреподавателя</name>
      <type>
        <types>CatalogRef.РолиПреподавателейСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоПросмотрВедомости</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьОтУченика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоЭлементаСправочникаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/СхемыМероприятийСУО/СхемыМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СхемыМероприятийСУО</name>
  <predefined>
    <items>
      <name>ОбщаяСкрытая</name>
      <description>(Не используется) Общая скрытая</description>
    </items>
    <items>
      <name>Общая</name>
      <description>Общая</description>
    </items>
  </predefined>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательноеПрохождение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗачислятьНаСледующееПослеПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/КаталогМероприятийСУО/Forms/ФормаСписка/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервереБезКонтекста
Процедура ПереместитьМероприятиеВНовыйКаталог(Мероприятие, ИмяНовогоКаталога, ТекущийЭлементНовогоКаталога=Неопределено)
	
	// Ищем нового владельца и нового родителя
	
	Владелец = Справочники.СхемыМероприятийСУО[ИмяНовогоКаталога];
	
	Если ЗначениеЗаполнено(ТекущийЭлементНовогоКаталога) Тогда
		
		ДанныеТекущегоЭлемента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущийЭлементНовогоКаталога, "ЭтоГруппа, Родитель");
		Родитель               = ДанныеТекущегоЭлемента.Родитель;
		
	Иначе
		
		Родитель = Справочники.КаталогМероприятийСУО.ПустаяСсылка();
		
	КонецЕсли;
		
	// Перезаписываем мероприятие
	
	НачатьТранзакцию();
	
	МероприятиеОбъект = Мероприятие.ПолучитьОбъект();
	МероприятиеОбъект.Владелец = Владелец;
	МероприятиеОбъект.Родитель = Родитель;
	
	Попытка 
		МероприятиеОбъект.Заблокировать();
	Исключение
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСТР("ru = 'Не удалось заблокировать объект %1'"),
			Строка(МероприятиеОбъект));
	КонецПопытки;
		
	МероприятиеОбъект.Записать();
	МероприятиеОбъект.Разблокировать();
	
	Если Мероприятие.ЭтоГруппа Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КаталогМероприятийСУО.Ссылка
			|ИЗ
			|	Справочник.КаталогМероприятийСУО КАК КаталогМероприятийСУО
			|ГДЕ
			|	КаталогМероприятийСУО.Ссылка В ИЕРАРХИИ(&Родитель)";

		Запрос.УстановитьПараметр("Родитель", Мероприятие);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			МероприятиеОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			МероприятиеОбъект.Владелец = Владелец;
			
			Попытка 
				МероприятиеОбъект.Заблокировать();
			Исключение
				ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСТР("ru = 'Не удалось заблокировать объект %1'"),
					Строка(МероприятиеОбъект));
			КонецПопытки;
				
			МероприятиеОбъект.Записать();
			МероприятиеОбъект.Разблокировать();

		КонецЦикла;

	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда
		
		Элементы.Скрытые.Видимость = Ложь;
		
	Иначе
		
		Элементы.Скрытые.Видимость = Истина;
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Список, Справочники.СхемыМероприятийСУО.Общая);
		ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(Скрытые, Справочники.СхемыМероприятийСУО.ОбщаяСкрытая);
		
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ПереместитьВСкрытые(Команда)
	
	ТекущиеДанныеОбщегоКаталога = Элементы.Список.ТекущиеДанные;
	ТекущиеДанныеСкрытогоКаталога = Элементы.Скрытые.ТекущиеДанные;
	
	Если ТекущиеДанныеОбщегоКаталога = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяНовогоКаталога = "ОбщаяСкрытая";
	Мероприятие = ТекущиеДанныеОбщегоКаталога.Ссылка;
	Если ТекущиеДанныеСкрытогоКаталога = Неопределено Тогда
		ТекущийЭлементНовогоКаталога = Неопределено;
	Иначе
		ТекущийЭлементНовогоКаталога = ТекущиеДанныеСкрытогоКаталога.Ссылка;
	КонецЕсли;
	
	ПереместитьМероприятиеВНовыйКаталог(Мероприятие, ИмяНовогоКаталога, ТекущийЭлементНовогоКаталога);
	
	Элементы.Список.Обновить();
	Элементы.Скрытые.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ПереместитьВОбщие(Команда)
	
	ТекущиеДанныеОбщегоКаталога = Элементы.Список.ТекущиеДанные;
	ТекущиеДанныеСкрытогоКаталога = Элементы.Скрытые.ТекущиеДанные;
	
	Если ТекущиеДанныеСкрытогоКаталога = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяНовогоКаталога = "Общая";
	Мероприятие = ТекущиеДанныеСкрытогоКаталога.Ссылка;
	Если ТекущиеДанныеОбщегоКаталога = Неопределено Тогда
		ТекущийЭлементНовогоКаталога = Неопределено;
	Иначе
		ТекущийЭлементНовогоКаталога = ТекущиеДанныеОбщегоКаталога.Ссылка;
	КонецЕсли;
	
	ПереместитьМероприятиеВНовыйКаталог(Мероприятие, ИмяНовогоКаталога, ТекущийЭлементНовогоКаталога);

	Элементы.Список.Обновить();
	Элементы.Скрытые.Обновить();
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ <Наименование>
